eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_usb.h
/**
  ******************************************************************************
  * @file    MDR32F9Qx_usb.h
  * @author  Phyton Application Team
  * @version V1.3.0
  * @date    01/02/2011
  * @brief   This file contains all the functions prototypes for the USB
  *          SFR access layer
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, PHYTON SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 Phyton</center></h2>
  ******************************************************************************
  * FILE MDR32F9Qx_usb.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F9Qx_USB_H
#define __MDR32F9Qx_USB_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32F9Qx_lib.h"

/** @addtogroup __MDR32F9Qx_StdPeriph_Driver MDR32F9Qx Standard Peripherial Driver
  * @{
  */

/** @addtogroup USB USB
  * @{
  */

/** @defgroup USB_Exported_Types USB Exported Types
  * @{
  */

/**
  * @brief EndPoints enumeration
  */

typedef enum
{
  USB_EP0  = 0,
  USB_EP1  = 1,
  USB_EP2  = 2,
  USB_EP3  = 3,
  Num_USB_EndPoints
}USB_EP_TypeDef;

#define IS_USB_ENDPOINT(ENDPOINT)       (((ENDPOINT) >= 0) && ((ENDPOINT) < Num_USB_EndPoints))

/**
  * @brief USB Clock Init Structure definition
  */

typedef struct
{
  uint32_t USB_USBC1_Source;       /*!< Specifies the source for USB_C1, if USB_C2 source is set to USB_C1.
                                        This parameter is one of @ref USB_USBC1_Source values. */
  uint32_t USB_PLLUSBMUL;          /*!< Specifies the source for USB_C1, if USB_C2 source is set to USB_PLL.
                                        This parameter is one of @ref USB_PLLUSB_Source values. */
}USB_Clock_TypeDef;

typedef struct
{
  uint8_t USB_Version;             /*!< USB Version. */
  uint8_t USB_Revision;            /*!< USB Revision. */
}USB_Version_TypeDef;

/** @} */ /* End of group USB_Exported_Types */

/** @defgroup USB_USBC2_Source USB USBC2 Source
  * @{
  */

#define USB_PLL                         ((uint32_t)0x00000004)

/** @} */ /* End of group USB_USBC2_Source */

/** @defgroup USB_USBC1_Source USB USBC1 Source
  * @{
  */

#define USB_C1HSIdiv1                  ((uint32_t)0x00000000)
#define USB_C1HSIdiv2                  ((uint32_t)0x00000001)
#define USB_C1HSEdiv1                  ((uint32_t)0x00000002)
#define USB_C1HSEdiv2                  ((uint32_t)0x00000003)

#define IS_USBC1_CLOCK_BRG(CLOCK)      (((CLOCK) >= 0) && ((CLOCK) <= 3))

/** @} */ /* End of group USB_USBC1_Source */

/** @defgroup USB_PLLUSB_Source USB PLLUSB Source
  * @{
  */

#define USB_PLLUSBMUL1                 ((uint32_t)0x00000000)
#define USB_PLLUSBMUL2                 ((uint32_t)0x00000001)
#define USB_PLLUSBMUL3                 ((uint32_t)0x00000002)
#define USB_PLLUSBMUL4                 ((uint32_t)0x00000003)
#define USB_PLLUSBMUL5                 ((uint32_t)0x00000004)
#define USB_PLLUSBMUL6                 ((uint32_t)0x00000005)
#define USB_PLLUSBMUL7                 ((uint32_t)0x00000006)
#define USB_PLLUSBMUL8                 ((uint32_t)0x00000007)
#define USB_PLLUSBMUL9                 ((uint32_t)0x00000008)
#define USB_PLLUSBMUL10                ((uint32_t)0x00000009)
#define USB_PLLUSBMUL11                ((uint32_t)0x0000000A)
#define USB_PLLUSBMUL12                ((uint32_t)0x0000000B)
#define USB_PLLUSBMUL13                ((uint32_t)0x0000000C)
#define USB_PLLUSBMUL14                ((uint32_t)0x0000000D)
#define USB_PLLUSBMUL15                ((uint32_t)0x0000000E)
#define USB_PLLUSBMUL16                ((uint32_t)0x0000000F)

#define IS_PLLUSBMUL(MUL)              (((MUL) >= 0) && ((MUL) < 16))

#define USB_CLOCK_48MHz                ((uint32_t)48000000)
#define IS_USB_CLOCK(MUL,USBC1)        (((USBC1 == USB_C1HSIdiv1) && (((MUL + 1)* HSI_Value) == USB_CLOCK_48MHz))       || \
                                        ((USBC1 == USB_C1HSIdiv2) && (((MUL + 1)* (HSI_Value / 2)) == USB_CLOCK_48MHz)) || \
                                        ((USBC1 == USB_C1HSEdiv1) && (((MUL + 1)* HSE_Value) == USB_CLOCK_48MHz))       || \
                                        ((USBC1 == USB_C1HSEdiv2) && (((MUL + 1)* (HSE_Value / 2)) == USB_CLOCK_48MHz)))

/** @} */ /* End of group USB_PLLUSB_Source */

/** @defgroup USB_HOST_REGS_Values USB_HOST Register Values
  * @{
  */

/** @defgroup USB_HSCR_Values USB_HSCR Values
  * @{
  */

#define USB_HSCR_HOST_MODE_Host              (uint32_t)(1 << USB_HSCR_HOST_MODE_Pos)
#define USB_HSCR_HOST_MODE_Device            (uint32_t)(1 << (USB_HSCR_HOST_MODE_Pos + 16))

#define USB_HSCR_RESET_CORE_Reset            (uint32_t)(1 << USB_HSCR_RESET_CORE_Pos)
#define USB_HSCR_RESET_CORE_Work             (uint32_t)(1 << (USB_HSCR_RESET_CORE_Pos + 16))

#define USB_HSCR_EN_TX_Set                   (uint32_t)(1 << USB_HSCR_EN_TX_Pos)
#define USB_HSCR_EN_TX_Reset                 (uint32_t)(1 << (USB_HSCR_EN_TX_Pos + 16))

#define USB_HSCR_EN_RX_Set                   (uint32_t)(1 << USB_HSCR_EN_RX_Pos)
#define USB_HSCR_EN_RX_Reset                 (uint32_t)(1 << (USB_HSCR_EN_RX_Pos + 16))

#define USB_HSCR_DP_PULLUP_Set               (uint32_t)(1 << USB_HSCR_DP_PULLUP_Pos)
#define USB_HSCR_DP_PULLUP_Reset             (uint32_t)(1 << (USB_HSCR_DP_PULLUP_Pos + 16))

#define USB_HSCR_DP_PULLDOWN_Set             (uint32_t)(1 << USB_HSCR_DP_PULLDOWN_Pos)
#define USB_HSCR_DP_PULLDOWN_Reset           (uint32_t)(1 << (USB_HSCR_DP_PULLDOWN_Pos + 16))

#define USB_HSCR_DM_PULLUP_Set               (uint32_t)(1 << USB_HSCR_DM_PULLUP_Pos)
#define USB_HSCR_DM_PULLUP_Reset             (uint32_t)(1 << (USB_HSCR_DM_PULLUP_Pos + 16))

