eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_usb.h
#define USB_HSCR_DM_PULLDOWN_Set             (uint32_t)(1 << USB_HSCR_DM_PULLDOWN_Pos)
#define USB_HSCR_DM_PULLDOWN_Reset           (uint32_t)(1 << (USB_HSCR_DM_PULLDOWN_Pos + 16))

#define USB_HSCR_SET_MASK                    (USB_HSCR_HOST_MODE_Host   | \
                                              USB_HSCR_RESET_CORE_Reset | \
                                              USB_HSCR_EN_TX_Set        | \
                                              USB_HSCR_EN_RX_Set        | \
                                              USB_HSCR_DP_PULLUP_Set    | \
                                              USB_HSCR_DP_PULLDOWN_Set  | \
                                              USB_HSCR_DM_PULLUP_Set    | \
                                              USB_HSCR_DM_PULLDOWN_Set)

#define USB_HSCR_RESET_MASK                  (USB_HSCR_SET_MASK << 16)

#define IS_USB_HSCR_VALUE(VALUE)             ((((VALUE) & (~(USB_HSCR_SET_MASK | USB_HSCR_RESET_MASK))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))
/** @} */ /* End of group USB_HSCR_Values */

/** @defgroup USB_HTXC_Values USB_HTXC Values
  * @{
  */

#define USB_HTXC_TREQ_Set                    (uint32_t)(1 << USB_HTXC_TREQ_Pos)
#define USB_HTXC_TREQ_Reset                  (uint32_t)(1 << (USB_HTXC_TREQ_Pos + 16))

#define USB_HTXC_SOFS_Set                    (uint32_t)(1 << USB_HTXC_SOFS_Pos)
#define USB_HTXC_SOFS_Reset                  (uint32_t)(1 << (USB_HTXC_SOFS_Pos + 16))

#define USB_HTXC_PREEN_Set                   (uint32_t)(1 << USB_HTXC_PREEN_Pos)
#define USB_HTXC_PREEN_Reset                 (uint32_t)(1 << (USB_HTXC_PREEN_Pos + 16))

#define USB_HTXC_ISOEN_Set                   (uint32_t)(1 << USB_HTXC_ISOEN_Pos)
#define USB_HTXC_ISOEN_Reset                 (uint32_t)(1 << (USB_HTXC_ISOEN_Pos + 16))

#define USB_HTXC_SET_MASK                    (USB_HTXC_TREQ_Set  | \
                                              USB_HTXC_SOFS_Set  | \
                                              USB_HTXC_PREEN_Set | \
                                              USB_HTXC_ISOEN_Set)

#define USB_HTXC_RESET_MASK                  (USB_HTXC_SET_MASK << 16)

#define IS_USB_HTXC_VALUE(VALUE)             ((((VALUE) & (~(USB_HTXC_SET_MASK | USB_HTXC_RESET_MASK))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_HTXC_Values */

/** @defgroup USB_HTXT_Values USB_HTXT Values
  * @{
  */

#define USB_HTXT_TTYPE_Setup                 (uint32_t)(0x00000000)
#define USB_HTXT_TTYPE_In                    (uint32_t)(0x00000001)
#define USB_HTXT_TTYPE_Outdata0              (uint32_t)(0x00000002)
#define USB_HTXT_TTYPE_Outdata1              (uint32_t)(0x00000003)

#define IS_USB_HTXT_VALUE(VALUE)             (((VALUE) == USB_HTXT_TTYPE_Setup)    || \
                                              ((VALUE) == USB_HTXT_TTYPE_In)       || \
                                              ((VALUE) == USB_HTXT_TTYPE_Outdata0) || \
                                              ((VALUE) == USB_HTXT_TTYPE_Outdata1))

/** @} */ /* End of group USB_HTXT_Values */

/** @defgroup USB_HTXLC_Values USB_HTXLC Values
  * @{
  */

#define USB_HTXLC_TXLC_DM_Set                (uint32_t)(1 << USB_HTXLC_Pos)
#define USB_HTXLC_TXLC_DM_Reset              (uint32_t)(1 << (USB_HTXLC_Pos + 16))

#define USB_HTXLC_TXLC_DP_Set                (uint32_t)(1 << (USB_HTXLC_Pos + 1))
#define USB_HTXLC_TXLC_DP_Reset              (uint32_t)(1 << (USB_HTXLC_Pos + 16 + 1))

#define USB_HTXLC_DC_Direct                  (uint32_t)(1 << USB_HTXLC_DC_Pos)
#define USB_HTXLC_DC_Normal                  (uint32_t)(1 << (USB_HTXLC_DC_Pos + 16))

#define USB_HTXLC_FSPL_Full                  (uint32_t)(1 << USB_HTXLC_FSPL_Pos)
#define USB_HTXLC_FSPL_Low                   (uint32_t)(1 << (USB_HTXLC_FSPL_Pos + 16))

#define USB_HTXLC_FSLR_12Mb                  (uint32_t)(1 << USB_HTXLC_FSLR_Pos)
#define USB_HTXLC_FSPL_1_5Mb                 (uint32_t)(1 << (USB_HTXLC_FSLR_Pos + 16))

#define USB_HTXLC_SET_MASK                   (USB_HTXLC_TXLC_DM_Set  | \
                                              USB_HTXLC_TXLC_DP_Set  | \
                                              USB_HTXLC_DC_Direct | \
                                              USB_HTXLC_FSPL_Full | \
                                              USB_HTXLC_FSLR_12Mb)

#define USB_HTXLC_RESET_MASK                 (USB_HTXLC_SET_MASK << 16)

#define IS_USB_HTXLC_VALUE(VALUE)            ((((VALUE) & (~(USB_HTXLC_SET_MASK | USB_HTXLC_RESET_MASK))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_HTXLC_Values */

/** @defgroup USB_HTXSE_Values USB_HTXSE Values
  * @{
  */

#define USB_HTXSE_SOFEN_Auto                 (uint32_t)(0x00000001)
#define USB_HTXSE_SOFEN_NonAuto              (uint32_t)(0x00000001 << 16)

#define IS_USB_HTXSE_VALUE(VALUE)            ((((VALUE) & (~(USB_HTXSE_SOFEN_Auto | USB_HTXSE_SOFEN_NonAuto))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_HTXSE_Values */

/** @defgroup USB_HIS_Values USB_HIS Values
  * @{
  */

#define USB_HIS_TDONE_Set                    USB_HIS_TDONE

#define USB_HIS_RESUME_Set                   USB_HIS_RESUME

#define USB_HIS_CONEV_Set                    USB_HIS_CONEV

#define USB_HIS_SOFS_Set                     USB_HIS_SOFS

#define IS_USB_HIS_VALUE(VALUE)              (((VALUE) == USB_HIS_TDONE_Set)  || \
                                              ((VALUE) == USB_HIS_RESUME_Set) || \
                                              ((VALUE) == USB_HIS_CONEV_Set)  || \
                                              ((VALUE) == USB_HIS_SOFS_Set))

/** @} */ /* End of group USB_HIS_Values */

/** @defgroup USB_HIM_Values USB_HIM Values
  * @{
  */

#define USB_HIM_TDONEIE_Set                  (uint32_t)(1 << USB_HIM_TDONEIE_Pos)
#define USB_HIM_TDONEIE_Reset                (uint32_t)(1 << (USB_HIM_TDONEIE_Pos + 16))

#define USB_HIM_RESUMEIE_Set                 (uint32_t)(1 << USB_HIM_RESUMEIE_Pos)
#define USB_HIM_RESUMEIE_Reset               (uint32_t)(1 << (USB_HIM_RESUMEIE_Pos + 16))

