eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_usb.h
#define USB_HIM_CONEVIE_Set                  (uint32_t)(1 << USB_HIM_CONEVIE_Pos)
#define USB_HIM_CONEVIE_Reset                (uint32_t)(1 << (USB_HIM_CONEVIE_Pos + 16))

#define USB_HIM_SOFIE_Set                    (uint32_t)(1 << USB_HIM_SOFIE_Pos)
#define USB_HIM_SOFIE_Reset                  (uint32_t)(1 << (USB_HIM_SOFIE_Pos + 16))

#define USB_HIM_SET_MASK                     (USB_HIM_TDONEIE_Set  | \
                                              USB_HIM_RESUMEIE_Set | \
                                              USB_HIM_CONEVIE_Set  | \
                                              USB_HIM_SOFIE_Set)

#define USB_HIM_RESET_MASK                   (USB_HIM_SET_MASK << 16)

#define IS_USB_HIM_VALUE(VALUE)              ((((VALUE) & (~(USB_HIM_SET_MASK | USB_HIM_RESET_MASK))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_HIM_Values */

/** @defgroup USB_HRXS_Values USB_HRXS Values
  * @{
  */

#define USB_HRXS_CRCERR_Set                  (uint32_t)(1 << USB_HRXS_CRCERR_Pos)
#define USB_HRXS_CRCERR_Reset                (uint32_t)(1 << (USB_HRXS_CRCERR_Pos + 16))

#define USB_HRXS_BSERR_Set                   (uint32_t)(1 << USB_HRXS_BSERR_Pos)
#define USB_HRXS_BSERR_Reset                 (uint32_t)(1 << (USB_HRXS_BSERR_Pos + 16))

#define USB_HRXS_RXOF_Set                    (uint32_t)(1 << USB_HRXS_RXOF_Pos)
#define USB_HRXS_RXOF_Reset                  (uint32_t)(1 << (USB_HRXS_RXOF_Pos + 16))

#define USB_HRXS_RXTO_Set                    (uint32_t)(1 << USB_HRXS_RXTO_Pos)
#define USB_HRXS_RXTO_Reset                  (uint32_t)(1 << (USB_HRXS_RXTO_Pos + 16))

#define USB_HRXS_NAKRXED_Set                 (uint32_t)(1 << USB_HRXS_NAKRXED_Pos)
#define USB_HRXS_NAKRXED_Reset               (uint32_t)(1 << (USB_HRXS_NAKRXED_Pos + 16))

#define USB_HRXS_STALLRXED_Set               (uint32_t)(1 << USB_HRXS_STALLRXED_Pos)
#define USB_HRXS_STALLRXED_Reset             (uint32_t)(1 << (USB_HRXS_STALLRXED_Pos + 16))

#define USB_HRXS_ACKRXED_Set                 (uint32_t)(1 << USB_HRXS_ACKRXED_Pos)
#define USB_HRXS_ACKRXED_Reset               (uint32_t)(1 << (USB_HRXS_ACKRXED_Pos + 16))

#define USB_HRXS_DATASEQ_Data1               (uint32_t)(1 << USB_HRXS_DATASEQ_Pos)
#define USB_HRXS_DATASEQ_Data0               (uint32_t)(1 << (USB_HRXS_DATASEQ_Pos + 16))

#define USB_HRXS_SET_MASK                    (USB_HRXS_CRCERR_Set    | \
                                              USB_HRXS_BSERR_Set     | \
                                              USB_HRXS_RXOF_Set      | \
                                              USB_HRXS_RXTO_Set      | \
                                              USB_HRXS_NAKRXED_Set   | \
                                              USB_HRXS_STALLRXED_Set | \
                                              USB_HRXS_ACKRXED_Set   | \
                                              USB_HRXS_DATASEQ_Data1)

#define USB_HRXS_RESET_MASK                  (USB_HRXS_SET_MASK << 16)

#define IS_USB_HRXS_VALUE(VALUE)             ((((VALUE) & (~(USB_HRXS_SET_MASK | USB_HRXS_RESET_MASK))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_HRXS_Values */

/** @defgroup USB_HRXCS_Values USB_HRXCS Values
  * @{
  */

#define USB_HRXCS_RXLS_Disconnect            (uint32_t)(0x00000000)
#define USB_HRXCS_RXLS_LowSpeed              (uint32_t)(0x00000001)
#define USB_HRXCS_RXLS_FullSpeed             (uint32_t)(0x00000002)

#define IS_USB_HRXCS_VALUE(VALUE)            (((VALUE) == USB_HRXCS_RXLS_Disconnect) || \
                                              ((VALUE) == USB_HRXCS_RXLS_LowSpeed)   || \
                                              ((VALUE) == USB_HRXCS_RXLS_FullSpeed))

/** @} */ /* End of group USB_HRXCS_Values */

#define IS_USB_HTXA_VALUE(VALUE)             ((VALUE)  < 0x00000080)
#define IS_USB_HTXE_VALUE(VALUE)             ((VALUE)  < 0x00000010)
#define IS_USB_HFN_VALUE(VALUE)              ((VALUE)  < 0x00000800)
#define IS_USB_HRXP_VALUE(VALUE)             ((VALUE)  < 0x00000010)
#define IS_USB_HRXA_VALUE(VALUE)             ((VALUE)  < 0x00000080)
#define IS_USB_HRXE_VALUE(VALUE)             ((VALUE)  < 0x00000010)
#define IS_USB_HSTM_VALUE(VALUE)             ((VALUE)  < 0x00000100)
#define IS_USB_HRXFD_VALUE(VALUE)            ((VALUE)  < 0x00000100)
#define IS_USB_HRXFDC_VALUE(VALUE)           ((VALUE)  < 0x00010000)
#define IS_USB_HRXFC_VALUE(VALUE)            ((VALUE) == 0x00000001)
#define IS_USB_HTXFD_VALUE(VALUE)            ((VALUE)  < 0x00000100)
#define IS_USB_HTXFC_VALUE(VALUE)            ((VALUE) == 0x00000001)

/** @} */ /* End of group USB_HOST_REGS_Values */

/** @defgroup USB_DEVICE_REGS_Values USB_DEVICE Register Values
  * @{
  */

/** @defgroup USB_SEPx_CTRL_Values USB_SEPx_CTRL Values
  * @{
  */

#define USB_SEPx_CTRL_EPEN_Enable            (uint32_t)(1 << USB_SEP_CTRL_EPEN_Pos)
#define USB_SEPx_CTRL_EPEN_Disable           (uint32_t)(1 << (USB_SEP_CTRL_EPEN_Pos + 16))

#define USB_SEPx_CTRL_EPRDY_Ready            (uint32_t)(1 << USB_SEP_CTRL_EPRDY_Pos)
#define USB_SEPx_CTRL_EPRDY_NotReady         (uint32_t)(1 << (USB_SEP_CTRL_EPRDY_Pos + 16))

#define USB_SEPx_CTRL_EPDATASEQ_Data1        (uint32_t)(1 << USB_SEP_CTRL_EPDATASEQ_Pos)
#define USB_SEPx_CTRL_EPDATASEQ_Data0        (uint32_t)(1 << (USB_SEP_CTRL_EPDATASEQ_Pos + 16))

#define USB_SEPx_CTRL_EPSSTALL_Reply         (uint32_t)(1 << USB_SEP_CTRL_EPSSTALL_Pos)
#define USB_SEPx_CTRL_EPSSTALL_NotReply      (uint32_t)(1 << (USB_SEP_CTRL_EPSSTALL_Pos + 16))

#define USB_SEPx_CTRL_EPISOEN_Set            (uint32_t)(1 << USB_SEP_CTRL_EPISOEN_Pos)
#define USB_SEPx_CTRL_EPISOEN_Reset          (uint32_t)(1 << (USB_SEP_CTRL_EPISOEN_Pos + 16))

#define USB_SEPx_CTRL_SET_MASK               (USB_SEPx_CTRL_EPEN_Enable     | \
                                              USB_SEPx_CTRL_EPRDY_Ready     | \
                                              USB_SEPx_CTRL_EPDATASEQ_Data1 | \
                                              USB_SEPx_CTRL_EPSSTALL_Reply  | \
                                              USB_SEPx_CTRL_EPISOEN_Set)

#define USB_SEPx_CTRL_RESET_MASK             (USB_SEPx_CTRL_SET_MASK << 16)

