eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_usb.h
#define IS_USB_SEPx_CTRL_VALUE(VALUE)        ((((VALUE) & (~(USB_SEPx_CTRL_SET_MASK | USB_SEPx_CTRL_RESET_MASK))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_SEPx_CTRL_Values */

/** @defgroup USB_SEPx_STS_Values USB_SEPx_STS Values
  * @{
  */

#define USB_SEPx_STS_SCCRCERR_Set            (uint32_t)(1 << USB_SEP_STS_SCCRCERR_Pos)
#define USB_SEPx_STS_SCCRCERR_Reset          (uint32_t)(1 << (USB_SEP_STS_SCCRCERR_Pos + 16))

#define USB_SEPx_STS_SCBSERR_Set             (uint32_t)(1 << USB_SEP_STS_SCBSERR_Pos)
#define USB_SEPx_STS_SCBSERR_Reset           (uint32_t)(1 << (USB_SEP_STS_SCBSERR_Pos + 16))

#define USB_SEPx_STS_SCRXOF_Set              (uint32_t)(1 << USB_SEP_STS_SCRXOF_Pos)
#define USB_SEPx_STS_SCRXOF_Reset            (uint32_t)(1 << (USB_SEP_STS_SCRXOF_Pos + 16))

#define USB_SEPx_STS_SCRXTO_Set              (uint32_t)(1 << USB_SEP_STS_SCRXTO_Pos)
#define USB_SEPx_STS_SCRXTO_Reset            (uint32_t)(1 << (USB_SEP_STS_SCRXTO_Pos + 16))

#define USB_SEPx_STS_SCNAKSENT_Set            (uint32_t)(1 << USB_SEP_STS_SCNAKSENT_Pos)
#define USB_SEPx_STS_SCNAKSENT_Reset         (uint32_t)(1 << (USB_SEP_STS_SCNAKSENT_Pos + 16))

#define USB_SEPx_STS_SCSTALLSENT_Set         (uint32_t)(1 << USB_SEP_STS_SCSTALLSENT_Pos)
#define USB_SEPx_STS_SCSTALLSENT_Reset       (uint32_t)(1 << (USB_SEP_STS_SCSTALLSENT_Pos + 16))

#define USB_SEPx_STS_SCACKRXED_Set           (uint32_t)(1 << USB_SEP_STS_SCACKRXED_Pos)
#define USB_SEPx_STS_SCACKRXED_Reset         (uint32_t)(1 << (USB_SEP_STS_SCACKRXED_Pos + 16))

#define USB_SEPx_STS_SCDATASEQ_Data1         (uint32_t)(1 << USB_SEP_STS_SCDATASEQ_Pos)
#define USB_SEPx_STS_SCDATASEQ_Data0         (uint32_t)(1 << (USB_SEP_STS_SCDATASEQ_Pos + 16))

#define USB_SEPx_STS_SET_MASK                (USB_SEPx_STS_SCCRCERR_Set    | \
                                              USB_SEPx_STS_SCBSERR_Set     | \
                                              USB_SEPx_STS_SCRXOF_Set      | \
                                              USB_SEPx_STS_SCRXTO_Set      | \
                                              USB_SEPx_STS_SCSTALLSENT_Set | \
                                              USB_SEPx_STS_SCNAKSENT_Set   | \
                                              USB_SEPx_STS_SCACKRXED_Set   | \
                                              USB_SEPx_STS_SCDATASEQ_Data1)

#define USB_SEPx_STS_RESET_MASK              (USB_SEPx_STS_SET_MASK << 16)

#define IS_USB_SEPx_STS_VALUE(VALUE)         ((((VALUE) & (~(USB_SEPx_STS_SET_MASK | USB_SEPx_STS_RESET_MASK))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_SEPx_STS_Values */

/** @defgroup USB_SEPx_TS_Values USB_SEPx_TS Values
  * @{
  */

#define USB_SEPx_TS_SCTTYPE_Setup            (uint32_t)(0x00000000)
#define USB_SEPx_TS_SCTTYPE_In               (uint32_t)(0x00000001)
#define USB_SEPx_TS_SCTTYPE_Outdata          (uint32_t)(0x00000002)

#define USB_SEPx_TS_SCTTYPE_Msk              (uint32_t)(0x00000003)

#define IS_USB_SEPx_TS_VALUE(VALUE)          (((VALUE) == USB_SEPx_TS_SCTTYPE_Setup)   || \
                                              ((VALUE) == USB_SEPx_TS_SCTTYPE_In)      || \
                                              ((VALUE) == USB_SEPx_TS_SCTTYPE_Outdata))

/** @} */ /* End of group USB_SEPx_TS_Values */

/** @defgroup USB_SEPx_NTS_Values USB_SEPx_NTS Values
  * @{
  */

#define USB_SEPx_NTS_NTTTYPE_Setup           (uint32_t)(0x00000000)
#define USB_SEPx_NTS_NTTTYPE_In              (uint32_t)(0x00000001)
#define USB_SEPx_NTS_NTTTYPE_Outdata         (uint32_t)(0x00000002)

#define USB_SEPx_NTS_NTTTYPE_Msk             (uint32_t)(0x00000003)

#define IS_USB_SEPx_NTS_VALUE(VALUE)         (((VALUE) == USB_SEPx_NTS_NTTTYPE_Setup)   || \
                                              ((VALUE) == USB_SEPx_NTS_NTTTYPE_In)      || \
                                              ((VALUE) == USB_SEPx_NTS_NTTTYPE_Outdata))

/** @} */ /* End of group USB_SEPx_NTS_Values */

/** @defgroup USB_SC_Values USB_SC Values
  * @{
  */

#define USB_SC_SCGEN_Set                     (uint32_t)(1 << USB_SCGEN_Pos)
#define USB_SC_SCGEN_Reset                   (uint32_t)(1 << (USB_SCGEN_Pos + 16))

#define USB_SC_SCTXLS_DM_Set                 (uint32_t)(1 << USB_SCTXLS_Pos)
#define USB_SC_SCTXLS_DM_Reset               (uint32_t)(1 << (USB_SCTXLS_Pos + 16))

#define USB_SC_SCTXLS_DP_Set                 (uint32_t)(1 << (USB_SCTXLS_Pos + 1))
#define USB_SC_SCTXLS_DP_Reset               (uint32_t)(1 << (USB_SCTXLS_Pos + 16 + 1))

#define USB_SC_SCDC_Direct                   (uint32_t)(1 << USB_SCDC_Pos)
#define USB_SC_SCDC_Normal                   (uint32_t)(1 << (USB_SCDC_Pos + 16))

#define USB_SC_SCFSP_Full                    (uint32_t)(1 << USB_SCFSP_Pos)
#define USB_SC_SCFSP_Low                     (uint32_t)(1 << (USB_SCFSP_Pos + 16))

#define USB_SC_SCFSR_12Mb                    (uint32_t)(1 << USB_SCFSR_Pos)
#define USB_SC_SCFSR_1_5Mb                   (uint32_t)(1 << (USB_SCFSR_Pos + 16))

#define USB_SC_SET_MASK                      (USB_SC_SCGEN_Set     | \
                                              USB_SC_SCTXLS_DM_Set | \
                                              USB_SC_SCTXLS_DP_Set | \
                                              USB_SC_SCDC_Direct   | \
                                              USB_SC_SCFSP_Full    | \
                                              USB_SC_SCFSR_12Mb)

#define USB_SC_RESET_MASK                    (USB_SC_SET_MASK << 16)

#define IS_USB_SC_VALUE(VALUE)               ((((VALUE) & (~(USB_SC_SET_MASK | USB_SC_RESET_MASK))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_SC_Values */

/** @defgroup USB_SLS_Values USB_SLS Values
  * @{
  */

