eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_usb.h
#define USB_SLS_SCRXLS_Reset                 (uint32_t)(0x00000000)
#define USB_SLS_SCRXLS_LowSpeed              (uint32_t)(0x00000001)
#define USB_SLS_SCRXLS_FullSpeed             (uint32_t)(0x00000002)

#define IS_USB_SLS_VALUE(VALUE)              (((VALUE) == USB_SLS_SCRXLS_Reset)     || \
                                              ((VALUE) == USB_SLS_SCRXLS_LowSpeed)  || \
                                              ((VALUE) == USB_SLS_SCRXLS_FullSpeed))

/** @} */ /* End of group USB_SLS_Values */

/** @defgroup USB_SIS_Values USB_SIS Values
  * @{
  */

#define USB_SIS_SCTDONE_Set                  USB_SIS_SCTDONE
#define USB_SIS_SCRESUME_Set                 USB_SIS_SCRESUME
#define USB_SIS_SCRESETEV_Set                USB_SIS_SCRESETEV
#define USB_SIS_SCSOFREC_Set                 USB_SIS_SCSOFREC
#define USB_SIS_SCNAKSENT_Set                USB_SIS_SCNAKSENT

#define USB_SIS_Msk                          USB_SIS_SCTDONE_Set   | \
                                             USB_SIS_SCRESUME_Set  | \
                                             USB_SIS_SCRESETEV_Set | \
                                             USB_SIS_SCSOFREC_Set  | \
                                             USB_SIS_SCNAKSENT_Set

#define IS_USB_SIS_VALUE(VALUE)              (((VALUE) == USB_SIS_SCTDONE_Set)   || \
                                              ((VALUE) == USB_SIS_SCRESUME_Set)  || \
                                              ((VALUE) == USB_SIS_SCRESETEV_Set) || \
                                              ((VALUE) == USB_SIS_SCSOFREC_Set)  || \
                                              ((VALUE) == USB_SIS_SCNAKSENT_Set))

/** @} */ /* End of group USB_SIS_Values */

/** @defgroup USB_SIM_Values USB_SIM Values
  * @{
  */

#define USB_SIM_SCTDONEIE_Set                (uint32_t)(1 << USB_SIM_SCTDONEIE_Pos)
#define USB_SIM_SCTDONEIE_Reset              (uint32_t)(1 << (USB_SIM_SCTDONEIE_Pos + 16))

#define USB_SIM_SCRESUMEIE_Set               (uint32_t)(1 << USB_SIM_SCRESUMEIE_Pos)
#define USB_SIM_SCRESUMEIE_Reset             (uint32_t)(1 << (USB_SIM_SCRESUMEIE_Pos + 16))

#define USB_SIM_SCRESETEVIE_Set              (uint32_t)(1 << USB_SIM_SCRESETEVIE_Pos)
#define USB_SIM_SCRESETEVIE_Reset            (uint32_t)(1 << (USB_SIM_SCRESETEVIE_Pos + 16))

#define USB_SIM_SCSOFRECIE_Set               (uint32_t)(1 << USB_SIM_SCSOFRECIE_Pos)
#define USB_SIM_SCSOFRECIE_Reset             (uint32_t)(1 << (USB_SIM_SCSOFRECIE_Pos + 16))

#define USB_SIM_SCNAKSENTIE_Set              (uint32_t)(1 << USB_SIM_SCNAKSENTIE_Pos)
#define USB_SIM_SCNAKSENTIE_Reset            (uint32_t)(1 << (USB_SIM_SCNAKSENTIE_Pos + 16))

#define USB_SIM_SET_MASK                     (USB_SIM_SCTDONEIE_Set   | \
                                              USB_SIM_SCRESUMEIE_Set  | \
                                              USB_SIM_SCRESETEVIE_Set | \
                                              USB_SIM_SCSOFRECIE_Set  | \
                                              USB_SIM_SCNAKSENTIE_Set)

#define USB_SIM_RESET_MASK                   (USB_SIM_SET_MASK << 16)

#define IS_USB_SIM_VALUE(VALUE)              ((((VALUE) & (~(USB_SIM_SET_MASK | USB_SIM_RESET_MASK))) == 0) && \
                                              ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_SIM_Values */

#define IS_USB_SA_VALUE(VALUE)               ((VALUE)  < 0x00000080)
#define IS_USB_SFN_VALUE(VALUE)              ((VALUE)  < 0x00000800)
#define IS_USB_SEPx_RXFD_VALUE(VALUE)        ((VALUE)  < 0x00000100)
#define IS_USB_SEPx_RXFDC_VALUE(VALUE)       ((VALUE)  < 0x00010000)
#define IS_USB_SEPx_RXFC_VALUE(VALUE)        ((VALUE) == 0x00000001)
#define IS_USB_SEPx_TXFD_VALUE(VALUE)        ((VALUE)  < 0x00000100)
#define IS_USB_SEPx_TXFDC_VALUE(VALUE)       ((VALUE) == 0x00000001)

/** @} */ /* End of group USB_DEVICE_REGS_Values */


/** @defgroup USB_Exported_Functions USB Exported Functions
  * @{
  */

void USB_BRGInit(const USB_Clock_TypeDef* USB_Clock_InitStruct);
void USB_Reset(void);

/**
  * @brief  Common register functions
  */

uint32_t USB_GetHSCR(void);
void     USB_SetHSCR(uint32_t RegValue);

USB_Version_TypeDef USB_GetHSVR(void);

/**
  * @brief  Host register functions
  */

uint32_t USB_GetHTXC(void);
void     USB_SetHTXC(uint32_t RegValue);
uint32_t USB_GetHTXT(void);
void     USB_SetHTXT(uint32_t RegValue);
uint32_t USB_GetHTXLC(void);
void     USB_SetHTXLC(uint32_t RegValue);
uint32_t USB_GetHTXSE(void);
void     USB_SetHTXSE(uint32_t RegValue);
uint32_t USB_GetHTXA(void);
void     USB_SetHTXA(uint32_t RegValue);
uint32_t USB_GetHTXE(void);
void     USB_SetHTXE(uint32_t RegValue);
uint32_t USB_GetHFN(void);
uint32_t USB_GetHIS(void);
void     USB_SetHIS(uint32_t RegValue);
uint32_t USB_GetHIM(void);
void     USB_SetHIM(uint32_t RegValue);
uint32_t USB_GetHRXS(void);
uint32_t USB_GetHRXP(void);
uint32_t USB_GetHRXA(void);
uint32_t USB_GetHRXE(void);
uint32_t USB_GetHRXCS(void);
uint32_t USB_GetHSTM(void);
uint32_t USB_GetHRXFD(void);
uint32_t USB_GetHRXFDC(void);
uint32_t USB_GetHRXFC(void);
void     USB_SetHRXFC(uint32_t RegValue);
uint32_t USB_GetHTXFD(void);
void     USB_SetHTXFD(uint32_t RegValue);
uint32_t USB_GetHTXFC(void);
void     USB_SetHTXFC(uint32_t RegValue);

/**
  * @brief  Slave register functions
  */

uint32_t USB_GetSEPxCTRL(USB_EP_TypeDef EndPointNumber);
void     USB_SetSEPxCTRL(USB_EP_TypeDef EndPointNumber, uint32_t RegValue);
uint32_t USB_GetSEPxSTS(USB_EP_TypeDef EndPointNumber);
uint32_t USB_GetSEPxTS(USB_EP_TypeDef EndPointNumber);
uint32_t USB_GetSEPxNTS(USB_EP_TypeDef EndPointNumber);
uint32_t USB_GetSC(void);
void     USB_SetSC(uint32_t RegValue);
uint32_t USB_GetSLS(void);
uint32_t USB_GetSIS(void);
void     USB_SetSIS(uint32_t RegValue);
uint32_t USB_GetSIM(void);
void     USB_SetSIM(uint32_t RegValue);
uint32_t USB_GetSA(void);
void     USB_SetSA(uint32_t RegValue);
uint32_t USB_GetSFN(void);
uint32_t USB_GetSEPxRXFD(USB_EP_TypeDef EndPointNumber);
uint32_t USB_GetSEPxRXFDC(USB_EP_TypeDef EndPointNumber);
uint32_t USB_GetSEPxRXFC(USB_EP_TypeDef EndPointNumber);
void     USB_SetSEPxRXFC(USB_EP_TypeDef EndPointNumber, uint32_t RegValue);
uint32_t USB_GetSEPxTXFD(USB_EP_TypeDef EndPointNumber);
void     USB_SetSEPxTXFD(USB_EP_TypeDef EndPointNumber, uint32_t RegValue);
uint32_t USB_GetSEPxTXFDC(USB_EP_TypeDef EndPointNumber);
void     USB_SetSEPxTXFDC(USB_EP_TypeDef EndPointNumber, uint32_t RegValue);
void     USB_SEPxToggleEPDATASEQ(USB_EP_TypeDef EndPointNumber);

/** @} */ /* End of group USB_Exported_Functions */

/** @} */ /* End of group USB */

/** @} */ /* End of group MDR32F9Qx_StdPeriph_Driver */

#ifdef __cplusplus
} // extern "C" block end
#endif

#endif /* __MDR32F9Qx_USB_H */

/******************* (C) COPYRIGHT 2011 Phyton *********
*
* END OF FILE MDR32F9Qx_usb.h */
